{
  "@metadata": {
    "authors": [
      "Anton"
    ],
    "last-updated": "2025-08-08",
    "locale": "en"
  },
  "l-aboutapp": "About",
  "l-appfeatures": "App Features",
  "l-rules": "Rules",
  "l-commonrules": "Common Rules",
  "l-news": "News",
  "l-downloads": "Downloads",
  "l-contacts": "Contacts",
  "l-leaderboard": "Leaderboard",
  "l-download": "Download",
  "l-main": "Home",
  "l-slogan": "BingoApp: Play, Win, Enjoy!",
  "l-socials": "Socials",
  "l-sitemap": "Site map",
  "l-contactus": "Contact us",
  "l-createdby": "Created by DirefulLemur0",
  "l-details": "Details",

  "d-text-1": "The app lets you play bingo with friends anytime.",
  "d-text-2": "Mod for Sekiro patch 1.06 for playing bingo.",
  "d-text-3": "ModEngine for Sekiro that enables modded gameplay.",
  "d-text-4": "Allows tracking of key items during randomizer runs.",
  "d-text-5": "Mod for Sekiro: Resurrection + Bingo version 1.16.1.",
  "d-text-6": "App for playing in Huntpoint mode (Beta).",

  "i-header-1": "Play bingo with friends<br> quickly and easily!",
  "i-text-1": "The app lets you play bingo with friends anytime.",
  "i-header-2": "Key Features",
  "i-header-3": "Discover a new way to have fun with BingoApp.",
  "i-header-4": "Ease of Use",
  "i-text-4": "An intuitive interface that lets you start a game in seconds.",
  "i-header-5": "Multiplayer",
  "i-text-5": "Play with friends or join open games with players from around the world.",
  "i-header-6": "Variety of Modes",
  "i-text-6": "Choose from different game modes to make each match unique.",
  "i-header-7": "What the App Offers",
  "i-header-8": "Why BingoApp?",
  "i-text-8": "The app lets you play bingo with friends anytime, anywhere.",
  "i-header-9": "Personalization",
  "i-text-9": "Customize your profile, board settings, and colors to your liking.",
  "i-header-10": "Regular Updates",
  "i-text-10": "The app is constantly improving with new features being added.",
  "i-header-11": "Dedicated Server",
  "i-text-11": "By connecting to our server, we guarantee 24/7 uptime.",
  "i-header-12": "Set Creation",
  "i-text-12": "Create and edit your own square sets for any game to make each match unique.",
  "i-header-13": "Board & Timer Sync",
  "i-text-13": "All players see synchronized boards and timers for a fair and engaging experience.",
  "i-header-14": "Game History",
  "i-text-14": "Keep a full history of your games and view it anytime.",
  "i-header-15": "Ready-Made Presets",
  "i-header-16": "Presets for Popular Games",
  "i-text-16": "BingoApp includes ready-made presets for your favorite games! Enjoy bingo with friends using presets for the following:",

  "f-header-1": "New Features in BingoApp 1.3.0",
  "f-header-2": "Highlighting Player's Potential Bingos",
  "f-text-2": "The highlighting feature helps instantly identify players close to winning. By clicking on a player's score panel, potential bingos on the board will be highlighted. This allows you to assess the situation in time, make strategic decisions, and boost the excitement of the game!",
  "f-header-3": "Toggle Between Player and Team Display Modes",
  "f-text-3": "A convenient toggle lets you instantly switch how participants are displayed. By clicking the \"Players\" label, the interface automatically switches between individual and team views, offering flexible control and better game overview.",
  "f-header-4": "Timer Stops After Victory",
  "f-text-4": "Once a winner is declared, the timer automatically stops, preventing unnecessary countdown continuation. This ensures accurate recording of the game’s end time.",
  "f-header-5": "Showing the changed square in the \"Change\" mode",
  "f-text-5": "In \"Change\" mode, it can be hard to tell which square changed and where. Now it’s easier: just click the swap message in the feed, and the changed square will be instantly highlighted on the board, helping you quickly orient and catch important changes.",
  "f-header-6": "Local Server and Cross-Device Room Access",
  "f-text-6-1": "The new version of BingoApp introduces local server support, allowing you to connect to an active room from any device on your network.",
  "f-text-6-2": "Setup is simple:",
  "f-text-6-3": "Specify a port in the app settings (if 5050 is occupied).",
  "f-text-6-4": "Enable local server launch — the app will request admin rights to open the port in Windows Firewall.",
  "f-text-6-5": "After that, you can create or join a room and access the local server via http://{Your PC's IP}:{PORT} from any device on the network.",
  "f-text-6-6": "When connecting from a mobile phone, you'll get a convenient interface showing the game board and all feed notifications, giving you full control over the game.",
  "f-header-7": "Overlay Window Above the Game",
  "f-text-7": "BingoApp now lets you open a separate window with the board, player list, timer, and latest notification, pinned above other apps. Perfect for those who want to follow the game without switching windows.<br>If your game doesn’t support \"Borderless Window\" mode, you can use the Borderless Gaming app for smooth display.",
  "f-header-8": "Send Presets to Other Players",
  "f-text-8": "BingoApp now makes it easy to share your presets! Send your set of squares and notes to any player directly in the app to sync strategies and enhance in-game collaboration.",

  "bm-header-1": "List of Mod Changes",
  "bm-text-1": "Removed startup logos of BANDAI NAMCO and FROM SOFTWARE.",
  "bm-text-2": "Removed all pop-up hints and tutorials.",
  "bm-text-3": "After completing the tutorial, the idol in Ashina Castle and Fountainhead Palace becomes immediately available.",
  "bm-text-4": "Added shortcut from the 'Castle Path' idol to the 'Death Staircase' idol via additional branches.",
  "bm-text-5": "Added option to skip the Giant battle in the Stockade. A new branch was added to the left of the boss.",
  "bm-text-6": "Added a branch for quickly bypassing the Great Serpent.",
  "bm-text-7": "Added a grapple point allowing access to the merchant and Tengu without triggering the battle with Gyoubu.",
  "bm-text-8": "Added branches allowing return from Ashina Castle to Ashina Outskirts for battles with Gyoubu or the Blazing Bull.",
  "bm-text-9": "Removed doors on the Genichiro arena to prevent trapping the boss.",
  "bm-text-10": "Added a grapple point allowing access from the Poison Pool to the Temple at the end of the cave in the Sunken Valley.",
  "bm-text-11": "Added branches allowing ascent from the bottom of the Sunken Valley to the Bodhisattva Valley idol.",
  "bm-text-12": "Added grapples and branches allowing access from the Bodhisattva Valley idol to the Shattered Cave idol.",
  "bm-text-13": "Changed the activation radius of the Fallen Monk to prevent bypassing the boss.",
  "bm-text-14": "Added an active idol near the Demon Bell and a passage to the main part of Senpou Temple up to the Armored Warrior boss.",
  "bm-text-15": "Added tips to loading screens.",
  "bm-text-16": "Changed images on loading screens.",
  "bm-text-17": "Added the ability to offer Gourd seeds at the idol.",
  "bm-text-18": "Added the ability to give/receive Kuro's Charm.",
  "bm-header-2": "Mod Changes Showcase",
  "bm-videolink": "https://www.youtube.com/embed/J6Zgu5cplyo?si=CxTTWdCN_E_RQGdU",

  "c-header-1": "Contact Us",
  "c-text-1": "We’d love for you to join us in the game! If you have any questions, suggestions, or need assistance, please don’t hesitate to reach out.",
  "c-discord": "Discord",
  "c-youtube": "YouTube",
  "c-header-2": "Want to get in touch?",
  "c-text-2": "Leave your message here and we’ll get back to you!",
  "c-name": "Nickname",
  "c-other": "Other method",
  "c-message": "Message",
  "c-send": "Send Message",

  "lb-bingo": "Bingo",
  "lb-othergames": "Other Games",
  "lb-leaderboard": "Leaderboard",
  "lb-player": "Player",
  "lb-games": "Games",
  "lb-wins": "Wins",
  "lb-results": "Game Results",
  "lb-noresults": "No results yet...",

  "r-header-1": "Game Formats",
  "r-text-1": "There are three common game formats:",
  "r-header-2": "Lockout:",
  "r-text-2": "Players compete by claiming squares on the board. The first player to complete a line (horizontal, vertical, or diagonal) wins. If no player completes a line, the winner is determined by the highest number of squares.",
  "r-header-3": "Triple Bingo:",
  "r-text-3": "Players must complete three lines (horizontal, vertical, or diagonal).",
  "r-header-4": "Blackout:",
  "r-text-4": "Players must complete all squares on the board.",
  "r-header-5": "Match Duration",
  "r-text-5": "Each match lasts 2 hours. If no player completes a line by the end of the time, the player with the most squares wins.",
  "r-header-6": "Fair Play Rules",
  "r-text-6": "All matches follow fair play rules. Players who violate these rules will be disqualified.",
  "r-header-7": "\"First you must be honest, then noble\"",
  "r-text-7": "- Winston Churchill",
  "r-header-8": "Use of Patches and Mods",
  "r-text-8": "Players must use the latest version of the game. All mods are prohibited except for specialized bingo mods.",
  "r-header-9": "Prohibited Actions",
  "r-text-9": "Exploits, skips, and glitches are strictly forbidden. For example, skipping bosses that aren’t intended to be skipped is not allowed.",
  "r-header-10": "Marking Squares",
  "r-text-10": "Players must mark squares as soon as they complete them. Hiding progress to surprise the opponent later is not allowed.",
  "r-header-11": "Incorrect Square Marking",
  "r-text-11": "If a player marks a square without completing its task, they have only 3 seconds to unmark it. If they fail to do so, the square becomes locked and cannot be completed. Additionally, the player receives a penalty. If two penalties are accumulated, the player automatically loses the match.<br>\nThese rules add intensity and urgency to the game! You must act quickly and carefully, or risk losing your chance to win.",
  "r-header-12": "Square Completion Conditions",
  "r-text-12": "To complete squares related to boss kills, players must wait for the reward screen (bead, memory) to appear. For non-boss squares, they should be marked immediately after the action is completed.",

  "rs-header-1": "Task List",
  "rs-text-1": "You can download the full list of tasks that may appear in Sekiro Bingo",
  "rs-text-1-1": "via this link.",
  "rs-header-2": "General Rules",
  "rs-text-2": "Sekiro Bingo follows standard bingo rules, which you can review",
  "rs-text-2-1": "on the website.",
  "rs-header-3": "Additional Rules",
  "rs-text-3-1": "The game must be updated to the latest patch 1.06.",
  "rs-text-3-2": "You must install BingoMod (<a href=\"/home/downloads\">available on the website</a>).",
  "rs-text-3-3": "All exploits, skips, and glitches are strictly prohibited.",
  "rs-text-3-4": "Gyoubu skip (Horse Skip) is not allowed.",
  "rs-text-3-5": "Demon of Hatred skip (Demon Skip) is not allowed.",
  "rs-text-3-6": "Elite Ashina Warrior skip (Dojo Skip & Front Dojo Skip) is not allowed.",
  "rs-text-3-7": "AI Break on mini-bosses is not allowed.",
  "rs-text-3-8": "Air Swim and any Out of Bounds exploits are not allowed.",
  "rs-text-3-9": "For the square, kill 3 enemies with three different deathblow techniques; killing geckos does not count.",
  "rs-text-3-10": "Match start rules",
  "rs-text-3-11": "During the preparation time (green timer in BingoApp), you can fully enter the game, where a white mist will appear blocking the way out of the pit.",
  "rs-text-3-12": "After the preparation time ends, the mist will disappear and you can start playing.",

  "h-header-1": "Huntpoint",
  "h-text-1": "Huntpoint is a competitive mode in Elden Ring: Nightreign and beyond, where players compete by completing tasks of varying value to earn points.",
  "h-text-2": "In Huntpoint, every match is a test of strategy, speed, and adaptability. Players must choose tasks wisely while considering their opponents’ actions — taking risky decisions or playing ahead of the curve. The harder the task, the more points it yields, but also the greater the chance of interference.",
  "h-text-3": "This mode creates a tense competitive atmosphere where every minute counts. Track your opponents’ progress, use tactics, and find opportunities for sudden turnarounds. Those who combine strategy and decisiveness best will become true Huntpoint masters!",
  "h-header-2": "Huntpoint Game Rules",
  "h-text-4": "Get familiar with the core mechanics, victory conditions, and strategies of Huntpoint — everything you need for an exciting start. <a href=\"/home/huntpointRules\">Read the rules</a>",
  "h-text-5": "The app is still in active development, and now is your chance to shape its future. If you're curious to preview new mechanics and participate in testing, you can download the beta version below. Your feedback, ideas, and suggestions will help us make Huntpoint even better.",
  "h-text-6": "Download Beta Version",

  "hr-header-1": "Game Format",
  "hr-text-1": "Huntpoint is a game format where each completed 'objective' earns you a certain number of points. The player with the highest total score wins.",
  "hr-text-2": "Objectives are divided into 4 types:",
  "hr-text-3": "Simple Objectives",
  "hr-text-4": "Rare Objectives",
  "hr-text-5": "Unique Objectives",
  "hr-text-6": "Legendary Objective",
  "hr-text-7": "The Legendary Objective always involves killing a Nightlord, and the specific Nightlord is chosen based on this objective before the game begins.",
  "hr-text-8": "Simple objectives yield the fewest points (1 to 2), but are relatively easy to complete.",
  "hr-text-9": "Rare objectives offer more points than simple ones (3 to 5), but are slightly harder to complete.",
  "hr-text-10": "Unique objectives grant a high number of points (7 to 13), but require advanced skill to complete.",
  "hr-text-11": "The Legendary Objective is the most difficult — defeat the Nightlord based on all progress made through other objectives. Completing it grants the maximum possible points (15 to 30).",
  "hr-header-2": "Board Generation:",
  "hr-text-12": "The board is randomly generated each time and includes a set of 20 objectives:",
  "hr-text-13": "10 simple",
  "hr-text-14": "6 rare",
  "hr-text-15": "3 unique",
  "hr-text-16": "1 legendary",
  "hr-text-17": "You may choose any class before starting your run.",
  "hr-header-3": "ALLOWED:",
  "hr-text-18": "Using any relics that enhance stats, skills, or weapons.",
  "hr-text-19": "Using relics that enhance a specific character.",
  "hr-text-20": "Marking an objective with a slight delay if you're outside the zone and at risk of dying.",
  "hr-text-21": "Completing any objectives of your choice.",
  "hr-text-22": "Using any skins.",
  "hr-text-23": "Increasing difficulty by mutual agreement (e.g., playing the entire run with unupgraded starting weapon).",
  "hr-text-24": "Watching your opponent’s stream if you’ve died permanently but are leading in points.",
  "hr-text-25": "Out of curiosity, asking which boss was in a specific location.",
  "hr-text-26": "Using wikis or other sources of information during the run.",
  "hr-header-4": "PROHIBITED:",
  "hr-text-27": "Using any relics that grant items in your inventory at the start of the run (e.g., grease, sword-shaped key, etc.).",
  "hr-text-28": "Hiding your progress or marking completed objectives with significant delay.",
  "hr-text-29": "Going after a Nightlord who is not listed on the board.",
  "hr-text-30": "Starting the game earlier than the agreed time.",
  "hr-text-31": "Sniping (watching) your opponent’s stream during the run.",
  "hr-text-32": "Spoiling your opponent’s progress via chat messages.",
  "hr-text-33": "Marking objectives before fully completing them."


}